In [76]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.model_selection import train_test_split
from sklearn.metrics import classification_report,confusion_matrix,recall_score,accuracy_score
from sklearn.naive_bayes import GaussianNB,MultinomialNB

%matplotlib inline

In [77]:
titanic = pd.read_csv('titanic.csv')
titanic.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [78]:
titanic.drop(['Name','PassengerId','SibSp','Parch','Ticket','Cabin','Embarked'],inplace=True,axis=1)
titanic.head(3)

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250

In [79]:
dummies = pd.get_dummies(titanic.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [80]:
titanic = pd.concat([titanic,dummies],axis=1)

In [81]:
titanic.drop('Sex',inplace=True,axis=1)

In [82]:
titanic.head(3)

   Survived  Pclass   Age     Fare  female  male
0         0       3  22.0   7.2500       0     1
1         1       1  38.0  71.2833       1     0
2         1       3  26.0   7.9250       1     0

In [83]:
titanic['Age'] = titanic['Age'].fillna(titanic['Age'].mean())

In [84]:
titanic.isna().sum()

Survived    0
Pclass      0
Age         0
Fare        0
female      0
male        0
dtype: int64

In [85]:
y = titanic.Survived

In [86]:
X = titanic.drop('Survived',axis=1)

In [87]:
y

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [88]:
X

     Pclass        Age     Fare  female  male
0         3  22.000000   7.2500       0     1
1         1  38.000000  71.2833       1     0
2         3  26.000000   7.9250       1     0
3         1  35.000000  53.1000       1     0
4         3  35.000000   8.0500       0     1
..      ...        ...      ...     ...   ...
886       2  27.000000  13.0000       0     1
887       1  19.000000  30.0000       1     0
888       3  29.699118  23.4500       1     0
889       1  26.000000  30.0000       0     1
890       3  32.000000   7.7500       0     1

[891 rows x 5 columns]

In [89]:
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.3,random_state=10)

In [90]:
X_train.head(3)

     Pclass   Age     Fare  female  male
7         3   2.0  21.0750       0     1
765       1  51.0  77.9583       1     0
339       1  45.0  35.5000       0     1

In [91]:
X_test.head(3)

     Pclass   Age    Fare  female  male
590       3  35.0  7.1250       0     1
131       3  20.0  7.0500       0     1
628       3  26.0  7.8958       0     1

In [92]:
y_train.head(3)

7      0
765    1
339    0
Name: Survived, dtype: int64

In [93]:
y_test.head(3)

590    0
131    0
628    0
Name: Survived, dtype: int64

In [94]:
nb = GaussianNB()

nb.fit(X_train,y_train)

GaussianNB()

In [96]:
y_pred = nb.predict(X_test)
y_pred

array([0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1,
       0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 0,
       1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 0, 0, 1, 0,
       0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0,
       1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 1, 1, 1,
       1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 1, 1,
       1, 1, 1, 1], dtype=int64)

In [97]:
print(confusion_matrix(y_test,y_pred))

[[150  24]
 [ 27  67]]

In [98]:
print(accuracy_score(y_test,y_pred))

0.8097014925373134

In [99]:
print(recall_score(y_test,y_pred))

0.7127659574468085

In [106]:
print(classification_report(y_test,y_pred,target_names=['Not Survived','Survived']))

              precision    recall  f1-score   support

Not Survived       0.85      0.86      0.85       174
    Survived       0.74      0.71      0.72        94

    accuracy                           0.81       268
   macro avg       0.79      0.79      0.79       268
weighted avg       0.81      0.81      0.81       268